Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་དང་འཐུན་པར་གནས་པའི་ཚུལ་ཁྲིམས་ཞེན་པ་མེད་པ་དེ་ལ། མ་ཆགས་པས་མཁས་པ་རྣམས་ཀྱིས་བསྔགས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Profound perfection of discipline is discipline free from clinging that remains in harmony with sentient beings and is praised for its detachment by the wise.

source: དང་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། ལྷག་པའི་བསམ་པ་ལ་འཇུག་པ་ལས་སོ། །
en: From that of the initial engendering of the mind of awakening and the practice of superior intent.

source: བདག་མེད་པ་དང་ལྡན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་སྨིན་པ་དང་། རྣམ་པར་སྨིན་པ་མ་ཡིན་པ་དང་། རྣམ་པར་སྨིན་པ་དང་བཅས་པ་ལ་རྣམ་པར་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Profound perfection of patience is the perfection of patience based on no self that does not conceive of ripening, no ripening, or involvement with ripening.

source: ཆོས་ཚོལ་བའི་སྤྱོད་པ་དང་ལྡན་པ་ལས་སོ། །
en: From that of a person engaged in investigating the teachings.

source: ཁམས་གསུམ་ལ་ཡང་མངོན་པར་ཞེན་པ་མེད་པ་ཡིན་ལ། མྱ་ངན་ལས་འདས་པ་ལ་རློམ་སེམས་སུ་ཡང་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Profound perfection of diligence is diligence that is free from clinging to any of the three realms and that does not conceptualize nirvāṇa.

source: མུ་སྟེགས་ཅན་གྱི་ཤེས་པ་ཟིལ་གྱིས་གནོན་པ་ལས་སོ། །
en: From the context of overpowering the non-Buddhist mindset.

source: ལམ་དང་བསམ་གཏན་ཤིན་ཏུ་ཟབ་པ་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Profound perfection of concentration is the path combined with extremely profound concentration.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆོས་དགེ་བར་བཏགས་པ་དང་མི་འགལ་བར་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པས་ཕྱེ་བ་ཉེ་བར་ཞི་བ་དང་རྒྱུ་འཐུན་པ།
en: Profound perfection of insight is the perfection of insight that maintains an absence of mental constructs without conflicting with any factors that are called virtuous.

source: སྤྲོས་པ་མེད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཟབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: It is distinguished in terms of its being unimpeded and is in causal accordance with quelling.

source: འདི་དག་ནི་ཟབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of profundity.

source: དེ་ལ་སྣ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of variety?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྣ་ཚོགས་སྟེར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེའི་རྣམ་པར་སྨིན་པ་གང་ཞེ་ན། ལུས་ལ་དཔེ་བྱད་སྣ་ཚོགས་པ་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on variety is the perfection of generosity that ripens as the diverse marks of distinction in the body and brings perfect acumen.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་པར་བྱེད་ཅིང་བསམ་པ་རྫོགས་པ་ཉེ་བར་གནས་པ་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on variety is committed to upholding buddha realms and the fulfillment of wishes.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྐྱོན་དང་བྲལ་བ་དེ་ནི་སེམས་ཅན་རྣམས་ལ་གནོད་སེམས་མེད་པར་གྱུར་ཅིག་ཅེས་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on variety is dedicated with the wish, ‘May this flawless buddha realm eradicate ill will in all beings.’

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སྨིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on variety is diligence that ripens the retinues of hearers, solitary buddhas, and bodhisattvas.

source: འཁོར་དྲེགས་པ་དང་། འདོད་ཆགས་ཅན་གྱི་ནང་ན་གནས་ཀྱང་སེམས་ལ་བརྗེད་ངས་པ་མེད་ཅིང་དྲན་པར་ཡོངས་སུ་བསྔོ་བའི་སེམས་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on variety is a mind dedicated to recollection and mindfulness even if one is surrounded by passionate and desirous people.

source: ཐབས་མཁས་པས་ཡོངས་སུ་ཟིན་པའི་ཤེས་རབ་ཐམས་ཅད་དུ་བརྗེད་ངས་པ་མེད་ཅིང་ཆོས་ཟབ་མོ་སྟོན་པ་ལ་གཞན་ལ་རག་མ་ལས་པ་གང་ཡིན་པ་དེ་ནི་སྣ་ཚོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on variety is insight embraced by skillful means, such that one teaches the profound Dharma without forgetfulness and without having to depend on others.

source: འདི་དག་ནི་སྣ་ཚོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of variety.

source: བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of displaying?

source: ཡིད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་བཟའ་བ་དང་བཏུང་བ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on displaying refers to distributing exquisite food and drink within buddha realms by means of the mind.

source: འཁོར་ཐམས་ཅད་ལ་བརྙས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on displaying is to be irreproachable within all gatherings.

source: སངས་རྒྱས་ཀྱི་ཞིང་ལག་མཐིལ་ལྟར་མཉམ་ཞིང་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་འཇམ་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་དག་འགྲུབ་ཅིང་བག་ཡོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on displaying is to bring forth a buddha realm that is level like the palm of a hand, soft to the touch like kacalindika cloth, and studded with numerous kinds of jewels.

source: འཁོར་ཚད་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on displaying is a boundless retinue.

source: འོད་དང་མཚན་ཕུན་སུམ་ཚོགས་ཤིང་། བསམ་པའི་སྐྱོན་དང་། རྣམ་པར་སྨིན་པ་དང་། དྲེགས་པ་དང་། ཉོན་མོངས་པ་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on displaying is to possess light and perfect features while being free from flawed thinking, ripening, passion, and emotional defilement.

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་ནས། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཀྱང་བརྗེད་ངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཀོད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on displaying is to be free from forgetfulness and to thus teach the Dharma even to beings born in the animal realm, based on having accomplished illusion-like absorption.

source: འདི་དག་ནི་བཀོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of displaying.

source: དེ་ལ་ཐུག་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of being unconquerable?

source: སྒྲིབ་པ་མེད་པའི་སེམས་ཀྱིས་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on being unconquerable is giving with a mind free from obscurations.

source: ཉོན་མོངས་པ་བྱུང་བ་སེལ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on being unconquerable is discipline that dispels the defilements.

source: སེམས་ཅན་གྱི་འདུ་ཤེས་རྒྱ་ཆེ་ཞིང་ཐུག་པ་མེད་པ་བསྒོམས་པ་ལ་མ་ཞུམ་པ་དང་། འཇིགས་པ་མེད་པས་རབ་ཏུ་ཕྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on being unconquerable is distinguished in terms of an absence of reservations and fear with respect to the vast and endless notions of sentient beings.

source: ཡེ་ཤེས་ལ་དམིགས་པས་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on being unconquerable is to subdue others by means of an apprehending wisdom.

source: བདག་མེད་པ་ལ་བཟོད་པར་གནས་ཤིང་ཡུལ་ལ་ལོངས་སྤྱོད་པའི་བསམ་གཏན་བརྗེད་ངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on being unconquerable is concentration that is free from forgetfulness in maintaining the acceptance of no self while experiencing objects.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པས་སྟོན་པ་ཐམས་ཅད་ལ་ཐུག་པ་མེད་པ་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཐུག་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on being unconquerable is the perfection of insight that is endowed with perfect eloquence, whereby one can teach in a way that is utterly unhindered while maintaining unimpeded concentrations, liberations, absorptions, and attainments.

source: འདི་དག་ནི་ཐུག་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of being unconquerable.

source: བྱམས་པ་སྔོན་དུ་འགྲོ་བའི་སྦྱིན་པས་ཡི་དགས་ཀྱི་ཡུལ་རྣམ་པར་སྦྱོང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity focused on sentient beings is preceded by love whereby the realms of starving spirits are purified.

source: དུད་འགྲོའི་སྐྱེ་གནས་རྣམ་པར་སྦྱོང་བར་བྱེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline focused on sentient beings is discipline that purifies the realms of animals.

source: ཉེས་པ་བྱས་པ་ཐམས་ཅད་བཟོད་ཅིང་སེམས་ཅན་དམྱལ་བ་སྦྱོང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on sentient beings patiently accepts any number of flaws and purifies the realms of hell beings.

source: བསྡུ་བའི་དངོས་པོ་རྣམ་པ་བཞི་དང་འཐུན་པར་ཕ་རོལ་གནོན་ཅིང་ལྷ་མ་ཡིན་གྱི་སྐྱེ་བ་ཡོངས་སུ་སྦྱོང་བ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on sentient beings overcomes others in accord with the four means of attracting disciples and purifies the realms of asuras.

source: བདག་ཉིད་ཉེ་བར་བཟུང་ནས་སེམས་ཅན་ལ་བདེ་བ་བསྒྲུབ་པ་ནི་དཔེར་ན་མི་འཁྲུགས་པའི་ཐུགས་དམ་ལས། ཕ་རོལ་གྱི་གཞི་ལས་འཚོ་ཞིང་ཐུགས་དམ་བཅུ་མཛད་པ་ལྟ་བུ་དང་། མི་རྣམས་ཡོངས་སུ་སྤྱོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on sentient beings accomplishes happiness for sentient beings by first taking hold of oneself. For example, from the commitments of Akṣobhya one is to be nourished for the sake of others and engage in the ten commitments. This also purifies the realms of humans.

source: ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་གནས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་རྒྱ་ཆེན་པོ་རབ་ཏུ་དབྱེ་བ་འབྱེད་ཅིང་སྟོན་ལ། ཉོན་མོངས་པ་རྣམ་པར་བྱང་བ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ལ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight focused on sentient beings presents and teaches the Dharma on a vast scale to sentient beings based on the relative truth, and it purifies the defilements.

source: འདི་དག་ནི་སེམས་ཅན་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections focused on sentient beings.

source: དེ་ལ་ཆོས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections focused on phenomena?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་འདོད་པས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity focused on phenomena is generosity performed with a wish for the eighteen unique qualities of a buddha.

source: སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེས་པའི་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་སྡོམ་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline focused on phenomena comprises the vows of body, speech, and mind that have arisen as the liberation gate of the absorption of wishlessness.

source: སྙིང་རྗེ་ཆེན་པོ་ལ་དམིགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on phenomena is the perfection of patience focused on great compassion.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྔོན་དུ་འགྲོ་བའི་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on phenomena is diligence that overpowers others and is effectuated by means of the four bases of miraculous power.

source: དྲན་པ་ཉེ་བར་གཞག་པ་སྔོན་དུ་འགྲོ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on phenomena is concentration that is preceded by the application of mindfulness.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ལས་བྱུང་བས་གཟུངས་ཇི་སྙེད་པ་དེ་དག་གི་ཡི་གེ་ལ་དཔྱོད་པར་བྱེད་ཅིང་བུལ་བ་མ་ཡིན་པས་སྒྲ་ཐམས་ཅད་ཤེས་ཤིང་སྟོན་ལ། མི་འཇིགས་པ་བཞི་ཡོངས་སུ་འཛིན་ཅིང་ཕྱིར་མི་ལྡོག་པ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ལ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight focused on phenomena has arisen from correct knowledge. Therefore, one comprehends the words that are contained in all retentions, whereby one swiftly masters all languages and becomes able to teach in them. One will teach in a manner that upholds the four types of fearlessness and makes one progress irreversibly with respect to these.

source: འདི་དག་ནི་ཆོས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections focused on phenomena.

source: དེ་ལ་ཞི་གནས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections focused on calm abiding?

source: སེམས་ལ་འཛིན་པ་མེད་པར་འགྱུར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: As the perfection of generosity is a mind without grasping,

source: སེམས་ལ་འཛིན་པ་མེད་པའི་ཕྱིར། གང་བདེན་པའི་བསམ་པས་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: the perfection of generosity focused on calm abiding is dedication by means of intention grounded in truth because the mind is without grasping.

source: སྒྲིབ་པ་ལྔ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline focused on calm abiding is that which relinquishes the five obscurations.

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བར་རྟོགས་པའི་ཤེས་པ་ལ་བཟོད་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on calm abiding is the expression of acceptance based on the knowledge that realizes impermanence and suffering.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྣམས་ཚོལ་བར་འབད་པ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on calm abiding is the endeavor to investigate the Dharma of emptiness, signlessness, and wishlessness.

source: ཏིང་ངེ་འཛིན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་འདི་ཡོངས་སུ་བཟུང་བས་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on calm abiding is absorption that quells the defilements by adopting the factors of awakening.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཞི་གནས་ལ་དགའ་བ། ཞི་གནས་ལ་དམིགས་པ། ཞི་གནས་བསྒོམ་པ། ཞི་གནས་ལ་འབབ་པ། ཞི་གནས་སྔོན་དུ་འགྲོ་ཞིང་རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་ལ་གཞན་གྱིས་མ་བསྟན་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་མི་ལྟུང་བ་གང་ཡིན་པ་དེ་ནི་ཞི་གནས་ལ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight focused on calm abiding is to delight in, focus on, cultivate, immerse oneself in, and prepare for calm abiding so that one attains the eight liberations, without being taught by others, and do not regress to the levels of hearers and solitary buddhas.

source: འདི་དག་ནི་ཞི་གནས་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections focused on calm abiding.

source: དེ་ལ་ལྷག་མཐོང་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections focused on special insight?

source: གང་གི་དང་། གང་གི་ཚེ་དང་། གང་ཟག་གང་ལ་ཡང་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity focused on special insight is generosity free from concepts about ownership, time, and recipients.

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ལྷག་པར་མཐོང་བ་བསགས་པས་མི་དམིགས་པས་ངེས་པར་གྱུར་པའི་སྡོམ་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline focused on special insight is the commitment to attain certainty through nonapprehension by gaining a deeper vision of the past and the future.

source: ཀུན་ནས་དཀྲིས་ཏེ་འདུག་པ་མ་ཡིན་པའི་སེམས་ཀྱིས་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དུ་ལྷག་པར་མཐོང་བའི་བཟོད་པ་སེམས་ཅན་དང་། སྲོག་དང་། གང་ཟག་དང་། གསོ་བའི་འདུ་ཤེས་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience focused on special insight is the patience of an unfettered mind that has special insight into the equality of all phenomena and is free of any view of a sentient being, life force, person, or living being.

source: ལྷག་མཐོང་ལ་དམིགས་ཤིང་ལྷག་མཐོང་སྐྱེད་པར་བྱེད་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི། ལྷག་མཐོང་ལ་དམིགས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence focused on special insight is diligence that focuses on and engenders special insight.

source: ལྷག་མཐོང་སྔོན་དུ་འགྲོ་ཞིང་ལྷག་མཐོང་གི་དབང་དུ་བྱས་ནས་བསམ་གཏན་ཐམས་ཅད་ཉེ་བར་ལེན་ལ་ཐབས་མཁས་པ་གང་ཡིན་པ་འདིས་ཀྱང་མངོན་པར་ཞེན་པ་མེད་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration focused on special insight is the skillful appropriation of all types of concentration in a way that is preceded and controlled by special insight.

source: འདོད་པ་རྣམས་ལ་ཐུག་པ་མེད་པ་གང་ཡིན་པ་དང་། གང་བསམ་གཏན་གྱི་ངོ་བོ་ཉིད་མ་ཡིན་པ་དང་། ཆོས་ལ་རྨོངས་པ་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཐོགས་པ་མེད་པའི་ཤེས་པ་གང་ཡིན་པ་དང་། ཟག་པ་མེད་པར་ཞུགས་ཤིང་སྙིང་རྗེ་ཆེན་པོའི་འདུས་བྱས་དང་ལྡན་པས་བདག་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། རང་གི་ས་ལས་མ་གཡོས་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight focused on special insight is unhindered knowledge for the sake of awakening that is unimpeded by desire, not of the nature of concentration, and free of delusion with respect to all phenomena. This is an engagement that is free of contaminants and endowed with the formation of great compassion, thus ripening both oneself and all beings without wavering from its own level.

source: འདི་དག་ནི་ལྷག་མཐོང་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections focused on special insight.

source: དེ་ལ་ཐམས་ཅད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of universality?

source: ཆོས་ཐམས་ཅད་ལ་དབུལ་བ་མ་ཡིན་པ་འཐོབ་པའི་ཕྱིར་སྦྱིན་པ་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on universality is generosity that is dedicated for the sake of attaining freedom from poverty with respect to all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་ཡོངས་སུ་བསྔོས་པ་ནི་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་བསྔོས་ལ། ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པའི་རྒྱུ་འཐུན་པ་འགྱོད་པ་མེད་པའི་རྩ་བ་རྣམ་པར་སྨིན་པ་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on universality is dedicated to the happiness of all sentient beings by means of great compassion. It is a concordant cause for attaining perfect wisdom and ensures that the roots of freedom from regrets will ripen.

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་བསྒྲུབ་ཅིང་ཡི་དམ་བརྟན་པོར་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on universality is the accomplishment of the qualities of irreversibility and adherence to firm resolve.

source: དད་པ་སྔོན་དུ་འགྲོ་བའི་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་ཟིན་པའི་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on universality is an endeavor that is embraced by insight preceded by faith.

source: དཔྱོད་པ་ཡང་དག་པ་ལས་བྱུང་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྦྱོར་བ་དཔག་ཏུ་མེད་པ་དམིགས་པ་ཐོགས་པ་མེད་པ་མི་དམིགས་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on universality is an infinite practice of the perfection of concentration that emerges from correct analysis, has boundless engagement and unimpeded observation, and is endowed with nonapprehension.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རིགས་ཀྱི་ཆོས་ལ་གནས་ཤིང་དད་པ་དང་། བརྩོན་འགྲུས་དང་། དྲན་པ་དང་། ཏིང་ངེ་འཛིན་གྱིས་བརྟན་པ་འགྱོད་པས་ཞུམ་པ་མེད་པར་སྦྱོར་ཞིང་ཐབས་མཁས་པས་ཡོངས་སུ་ཟིན་པ་འཇིག་རྟེན་པ་དང་། སློབ་པ་དང་། མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཤེས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཆོས་ཐམས་ཅད་མཁྱེན་པ་ལས་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on universality is the perfection of insight that adheres to the appropriate factors and—due to faith, diligence, mindfulness, and absorption—displays mastery of skillful means in a way that is firm and unaffected by regrets. It arises from the knowledge of all phenomena, be they of the world, training, no training, the knowledge of solitary buddhas, or those of unexcelled and perfect awakening.

source: འདི་དག་ནི་ཐམས་ཅད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of universality.

source: དེ་ལ་ཕྱོགས་གཅིག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of partiality?

source: བྱང་ཆུབ་སེམས་དཔའ་རང་གིས་སེམས་ཀྱིས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on partiality is the giving bodhisattvas do on their own and according to their own mind.

source: ཆོས་ལ་ཁ་ཅིག་ཏུ་ནི་ཚུལ་ཁྲིམས་ཀྱི་འདུ་ཤེས། ཁ་ཅིག་ཏུ་ནི་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་འདུ་ཤེས་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on partiality is when a teaching is conceived of as a discipline for some people but as a violation of discipline for other people.

source: དམིགས་པ་ལ་གནས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on partiality is the patience based on apprehensions.

source: རྣམ་པར་དབྱེ་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on partiality is a diligence that discriminates.

source: དངོས་པོ་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on partiality is concentration focused on entities.

source: སྤྱོད་པ་དང་། སེལ་བའི་འདུ་ཤེས་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཕྱོགས་གཅིག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on partiality is insight that conceives in terms of analysis and eliminative reasoning.

source: འདི་དག་ནི་ཕྱོགས་གཅིག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of partiality.

source: དེ་ལ་ཉམས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six incorruptible perfections?

source: སྦྱིན་གནས་རྣམས་དང་སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་སེམས་མཉམ་པ་ཉིད་ཀྱིས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Incorruptible perfection of generosity is giving with a mind of equality toward objects of veneration and ordinary beings.

source: མི་གནས་པའི་སྡོམ་པ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Incorruptible perfection of discipline is the vow of nonabiding.

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་བསྒྱུར་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Incorruptible perfection of patience is patience that cannot be swayed by the eight worldly concerns.

source: བདུད་ཀྱི་མཐུ་ཁོང་དུ་ཆུད་པས་ཇི་ལྟར་ཉམ་ཐག་ཀྱང་བརྩོན་འགྲུས་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Incorruptible perfection of diligence is diligence that is based on understanding the powers of the māras and consequently not giving up no matter how hard it may be.

source: སྒྲིབ་པ་མེད་པའི་ཆོས་ལ་ལྷག་པར་མོས་ཤིང་ཡུལ་ལ་མཉམ་པ་ཉིད་རབ་ཏུ་ཐོབ་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཉམས་པ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Incorruptible perfection of concentration is the perfection of concentration that is inspired by the qualities of being free from obscuration and has achieved equanimity with respect to objects.
